{
  "projects": [
    {
      "id": "1",
      "title": "Island House",
      "repoURL": "https://github.com/HamedPour/Island-House",
      "coverImage": "/langLogos/htmlLogo.jpg",
      "websiteURL": "http://islandhouseholyisland.co.uk/",
      "details": "This is a multi-page, custom-designed website developed for a small business client. I utilised HTML5, SCSS, JavaScript and a splash of jQuery. I learned a lot from this project and the client was very happy with the result."
    },
    {
      "id": "2",
      "title": "React Calculator",
      "repoURL": "https://github.com/HamedPour/react-calculator",
      "coverImage": "/langLogos/reactLogo.jpg",
      "websiteURL": "https://hamedpour.github.io/react-calculator/",
      "details": "This is a fun little calculator app created using React, learning a lot about proper state management along the way."
    },
    {
      "id": "3",
      "title": "Adventure Shop",
      "repoURL": "https://github.com/HamedPour/PERN-adventure-shop",
      "coverImage": "/langLogos/PPERRN.png",
      "websiteURL": "https://adventure-shop.herokuapp.com/",
      "details": "This is a full stack application created from the ground up using Express, React, Redux, Postgresql, Node, and the Paypal Dev Api. The application utilises JWT authentication, bcrypt password hashing,  and server/client side route guarding among many other packages. The payment gateway is handled by Paypal and setup to use Paypal's sandbox api. This app was an absolute pleasure to build."
    },
    {
      "id": "4",
      "title": "Game of Life",
      "repoURL": "https://github.com/HamedPour/game-of-life",
      "coverImage": "/langLogos/jsLogo.png",
      "websiteURL": "https://hamedpour.github.io/game-of-life/",
      "details": "This is Conway's Game of Life, created using vanilla JavaScript and HTML Canvas. It's surprisingly addictive to watch - click on the live preview to see for yourself."
    },
    {
      "id": "5",
      "title": "Project Euler",
      "repoURL": "https://github.com/HamedPour/ProjectEuler",
      "coverImage": "/langLogos/cppLogo.jpg",
      "websiteURL": "",
      "details": "This repository is part of an ongoing project with the WB[Collective] team. I am focussing on learning more mathematics while also completing Project Euler challenges. I have personally decided to code it in C++ to improve my lower level programming skills."
    },
    {
      "id": "6",
      "title": "ToDo App (PERN)",
      "repoURL": "https://github.com/HamedPour/PERN-todoApp",
      "coverImage": "/langLogos/PERN.png",
      "websiteURL": "https://pern-todo-app-hamed.herokuapp.com/",
      "details": "This is a fullstack PERN (Postgresql, Express, React, Node) Todo Application. The app is fairly simple but you can do all the CRUD functionalities and everything is stored nicely on a remote database. This app was a pleasure to make and an excellent learning opportunity since I had to implement everything from the group up and bring together everything I had learned so far. I decided not to use a database ORM and instead just use the PG node package to do all my database related calls. "
    },
    {
      "id": "7",
      "title": "Clear View",
      "repoURL": "https://github.com/HamedPour/travel-site",
      "coverImage": "/langLogos/htmlLogo.jpg",
      "websiteURL": "https://hamedpour.github.io/travel-site/",
      "details": "This website is one of the first I ever made using HTML, CSS and JavaScript. It is a mock travel website and never fails to make me feel sentimental for my earliest days of programming."
    },
    {
      "id": "8",
      "title": "Ship Loader (C#)",
      "repoURL": "https://github.com/HamedPour/ShipLoadingGame",
      "coverImage": "/langLogos/cSharpLogo.png",
      "details": "This is a C# OOP game. It uses inherence and other object oriented features to create a fun little ship cargo loading simulator. I don’t usually write C# but when I do I love how robust and exact it is. Strong typing for the win!   "
    },
    {
      "id": "9",
      "title": "Lifespan Counter",
      "repoURL": "https://github.com/HamedPour/lifespan-counter",
      "coverImage": "/langLogos/vueLogo.jpg",
      "websiteURL": "",
      "details": "This counter app was made using Vue.js to calculate an individual’s predicted remaining lifespan. For a quick project of a few hours, I found the output rather satisfying."
    },
    {
      "id": "10",
      "title": "Pairs Game",
      "repoURL": "https://github.com/HamedPour/pairs-game",
      "coverImage": "/langLogos/jsLogo.png",
      "websiteURL": "https://hamedpour.github.io/pairs-game/",
      "details": "This is a little match the pairs game I made using JS. Give it a shot if you have a few minutes and see if you can beat my 45 clicks win"
    },
    {
      "id": "11",
      "title": "Mykee's Prime",
      "repoURL": "https://github.com/HamedPour/mykees-prime-game",
      "coverImage": "/langLogos/reactLogo.jpg",
      "websiteURL": "https://hamedpour.github.io/mykees-prime-game/",
      "details": "This is a fun little prime game I made using React in honour of Mr Mykee. Wonderful lad that he is."
    },
    {
      "id": "12",
      "title": "Ecommerce",
      "repoURL": "https://github.com/HamedPour/ecommerce-node",
      "coverImage": "/langLogos/nodeLogo.jpg",
      "websiteURL": "",
      "details": "This is an e-commerce node back-end application I started developing using express, Mongoose and handlebars. The code is messy and unmodulated and the website not very optimised with unacceptable levels of lag. This was more a fun activity for me in order to see how long it would take to prototype an e-commerce website."
    },
    {
      "id": "13",
      "title": "Margaux Gallery",
      "repoURL": "https://github.com/HamedPour/margaux-gallery",
      "coverImage": "/langLogos/vueLogo.jpg",
      "websiteURL": "",
      "details": "This was a gallery website I made with Vue.js and Vuetify.js. I can’t emphasis enough how much I enjoyed working with Vue. For the database I used the very intuitive noSql database Firebase. Now it has a range of outdated dependencies, so is currently offline."
    },
    {
      "id": "14",
      "title": "Trump Invasion Shooter",
      "repoURL": "https://github.com/HamedPour/TrumpInvasion",
      "coverImage": "/langLogos/cSharpLogo.png",
      "details": "This is a simple C# space shooter game created using .net Forms. Since it's close to the 2020 US election I just had to put Trump's face on the aliens. Vote Him Out!"
    }
  ]
}
